#---------------------------------------------------------모듈 import------------------------------------------------------------------

from vector_drawing import *

#----------------------------------------------------------함수 정의-------------------------------------------------------------------

def add(v1, v2): #더하기 정의
    return (v1[0] + v2[0], v1[1] +  v2[1]) 

def add2(*vectors): #임의 개수 벡터 더하기 
    return (sum(v[0] for v in vectors),sum(v[1] for v in vectors))

def length(v): #길이 구하기 정의
    return sqrt(v[0]**2 + v[1]**2)

def distance(v1, v2):
    return sqrt((v2[0]-v1[0])**2 + (v2[1]-v1[1])**2)


#----------------------------------------------------------변수 정의-------------------------------------------------------------------

dino_vectors = [(6,4), (3,1), (1,2), (-1,5), (-2,5), (-3,4), (-4,4), (-6,3),
                (-6,2),(-2,2),(-6,1), (-5,0),(-2,1),(-1,0), (0,-3), (-1,-4), 
                (1,-4), (2,-3), (1,-2), (3,-1), (5,1)]

dino_vectors2 = [add((-1.5, -2.5), v) for v in dino_vectors]

#----------------------------------------------------------코드 작성-------------------------------------------------------------------

draw(
#     Points(*dino_vectors, color = blue),
#     Polygon(*dino_vectors, color = blue),
#     Points(*dino_vectors2, color = red),
#     Polygon(*dino_vectors2, color = red),
)
    

# for n in range(-12,15):  #2.26 연습문제
#     for m in range(-14,13):
#         if distance((n,m),(1,-1)) == 13 and n > m and m > 0:
#             print(n)
#             print(m)

